// 682 easy 棒球比赛

// 你现在是棒球比赛记录员。
// 给定一个字符串列表，每个字符串可以是以下四种类型之一：
// 1.整数（一轮的得分）：直接表示您在本轮中获得的积分数。
// 2. "+"（一轮的得分）：表示本轮获得的得分是前两轮有效 回合得分的总和。
// 3. "D"（一轮的得分）：表示本轮获得的得分是前一轮有效 回合得分的两倍。
// 4. "C"（一个操作，这不是一个回合的分数）：表示您获得的最后一个有效 回合的分数是无效的，应该被移除。
//
// 每一轮的操作都是永久性的，可能会对前一轮和后一轮产生影响。
// 你需要返回你在所有回合中得分的总和。
//
// 示例 1:
//
// 输入: ["5","2","C","D","+"]
// 输出: 30
// 解释:
//     第1轮：你可以得到5分。总和是：5。
// 第2轮：你可以得到2分。总和是：7。
// 操作1：第2轮的数据无效。总和是：5。
// 第3轮：你可以得到10分（第2轮的数据已被删除）。总数是：15。
// 第4轮：你可以得到5 + 10 = 15分。总数是：30。
// 示例 2:
//
// 输入: ["5","-2","4","C","D","9","+","+"]
// 输出: 27
// 解释:
//     第1轮：你可以得到5分。总和是：5。
// 第2轮：你可以得到-2分。总数是：3。
// 第3轮：你可以得到4分。总和是：7。
// 操作1：第3轮的数据无效。总数是：3。
// 第4轮：你可以得到-4分（第三轮的数据已被删除）。总和是：-1。
// 第5轮：你可以得到9分。总数是：8。
// 第6轮：你可以得到-4 + 9 = 5分。总数是13。
// 第7轮：你可以得到9 + 5 = 14分。总数是27。
// 注意：
//
// 输入列表的大小将介于1和1000之间。
// 列表中的每个整数都将介于-30000和30000之间。


/**
 * @param {string[]} ops
 * @return {number}
 */
var calPoints = function(ops) {
    // 记录最近3个有效回合的得分
    let arr = []
    // 最终得分
    let ans = 0;
    for(let i = 0; i < ops.length; i++){
        if(ops[i] === '+'){
            ans += arr[arr.length-1] + arr[arr.length-2];
            // +也算一次得分
            arr.push(arr[arr.length-1] + arr[arr.length-2])
            // if(arr.length > 3){
            //     arr.shift()
            // }
        }else if(ops[i] === 'D'){
            ans += arr[arr.length-1] * 2;
            // D也算一次得分
            arr.push(arr[arr.length-1] * 2)
            // if(arr.length > 3){
            //     arr.shift()
            // }
        }else if(ops[i] === 'C'){
            ans -= arr[arr.length-1]
            // 删除最后一次有效的记录，把倒数第二次有效记为倒数第一次有效
            arr.pop()
        }else{
            ans += Number(ops[i]);
            arr.push(ops[i] / 1);
            // if(arr.length > 3){
            //     arr.shift();
            // }
        }
    }
    return ans;
};

console.log(calPoints(["5","-2","4","C","D","9","+","+"]))
console.log(calPoints(["5","2","C","D","+"]))
console.log(calPoints(["36","28","70","65","C","+","33","-46","84","C"]))
console.log(calPoints(["8373","C","9034","-17523","D","1492","7558","-5022","C","C","+",
    "+","-16000","C","+","-18694","C","C","C","-19377","D","-25250","20356","C","-1769","-8303",
    "C","-25332","29884","C","+","C","-29875","-15374","C","+","14584","13773","+","17037","-28248",
    "+","16822","D","+","+","-19357","-26593","-8548","4776","D","-8244","378","+","-19269","-25447",
    "18922","-16782","2886","C","-17788","D","-22256","C","308","-9185","-19074","1528","28424",
    "D","8658","C","7221","-13704","8995","-21650","22567","-29560","D","-9807","25632","6817",
    "28654","D","-18574","C","D","20103","7875","C","9911","23951","C","D","C","+","18219",
    "-20922","D","-24923"]))